#SubQueries

In [ ]:
1.

SELECT name
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

In [ ]:
2.

SELECT name
FROM employees
WHERE department_id =
(
  SELECT department_id
  FROM employees
  GROUP BY department_id
  ORDER BY AVG(salary) DESC
  LIMIT 1
);

In [ ]:
3.

SELECT name
FROM employees
WHERE emp_id IN (SELECT emp_id FROM sales);

In [ ]:
4.

SELECT name
FROM employees
WHERE emp_id =
(
  SELECT emp_id
  FROM sales
  ORDER BY sale_amount DESC
  LIMIT 1
);

In [ ]:
5.

SELECT name
FROM employees
WHERE salary >
(
  SELECT salary
  FROM employees
  WHERE name = 'Shubham'
);

In [ ]:
6.

SELECT name
FROM employees
WHERE department_id =
(
  SELECT department_id
  FROM employees
  WHERE name = 'Abhishek'
);

In [ ]:
7.

SELECT department_name
FROM departments
WHERE department_id IN
(
  SELECT department_id
  FROM employees
  WHERE salary > 60000
);

In [ ]:
8.

SELECT department_name
FROM departments
WHERE department_id =
(
  SELECT department_id
  FROM employees
  WHERE emp_id =
  (
    SELECT emp_id
    FROM sales
    ORDER BY sale_amount DESC
    LIMIT 1
  )
);

In [ ]:
9.

SELECT DISTINCT name
FROM employees
WHERE emp_id IN
(
  SELECT emp_id
  FROM sales
  WHERE sale_amount > (SELECT AVG(sale_amount) FROM sales)
);

In [ ]:
10.

SELECT SUM(sale_amount) AS total_sales
FROM sales
WHERE emp_id IN
(
  SELECT emp_id
  FROM employees
  WHERE salary > (SELECT AVG(salary) FROM employees)
);

In [ ]:
11.

SELECT name
FROM employees
WHERE emp_id NOT IN (SELECT emp_id FROM sales);

In [ ]:
12.

SELECT department_name
FROM departments
WHERE department_id IN
(
  SELECT department_id
  FROM employees
  GROUP BY department_id
  HAVING AVG(salary) > 55000
);

In [ ]:
13.

SELECT department_name
FROM departments
WHERE department_id IN
(
  SELECT department_id
  FROM employees
  WHERE emp_id IN
  (
    SELECT emp_id
    FROM sales
    GROUP BY emp_id
    HAVING SUM(sale_amount) > 10000
  )
);

In [ ]:
14.

SELECT name
FROM employees
WHERE emp_id =
(
  SELECT emp_id
  FROM sales
  ORDER BY sale_amount DESC
  LIMIT 1 OFFSET 1
);

In [ ]:
15.

SELECT name
FROM employees
WHERE salary >
(
  SELECT MAX(sale_amount)
  FROM sales
);